Hieu chinh compare.md
